Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Be notified when the application stops
ja_jp: アプリケーションが停止したときに通知される

source: Be patient, we will explain the `Build Step Processor` concept and all the extension deployment API later on. At this point, you just need to understand that this class explains to Quarkus how to deploy a feature named `greeting` which is your extension. In other words, you are augmenting your application to use the `greeting` extension with all the Quarkus benefits (build time optimization, native support, etc.).
ja_jp: `Build Step Processor` の概念とすべてのエクステンションのデプロイメント API については、後で説明します。この時点では、このクラスは、 `greeting` というエクステンションをデプロイする方法を Quarkus に説明していることを理解する必要があります。つまり、アプリケーションを拡張して、Quarkus のすべての利点 (ビルド時間の最適化、ネイティブサポートなど) とともに `greeting` エクステンションを使用することになります。

source: Be patient, we will explain the `Build Step Processor` concept and all the extension deployment API later on. At this point, you just need to understand that this class explains to Quarkus how to deploy a feature named `greeting`, which is your extension. In other words, you are augmenting your application to use the `greeting` extension with all the Quarkus benefits (build time optimization, native support, etc.).
ja_jp: ご安心ください。`Build Step Processor` の概念とすべてのエクステンションのデプロイメント API については後で説明します。この時点では、このクラスが Quarkus に対して、エクステンションである `greeting` という名前の機能をデプロイする方法を説明していることを理解する必要があります。言い換えれば、Quarkus のすべての利点 (ビルド時最適化、ネイティブサポートなど) とともに `greeting` エクステンションを使用するようにアプリケーションをオーグメンテーションしています。

source: Be simple to build, run, deploy, and demo on a local developer machine or in Kubernetes.
ja_jp: ローカルの開発者用マシンやKubernetes上で、ビルド、実行、デプロイ、デモが簡単にできること。

source: Be supported by our tooling;
ja_jp: 我々のツールでサポート。

source: Be sure to call your `verify` and `do*` methods on `PanacheMock` rather than `Mockito`, otherwise you won't know what mock object to pass.
ja_jp: `verify` と `do*` のメソッドは `Mockito` ではなく `PanacheMock` で呼び出すようにしてください。そうしないとどのモックオブジェクトを渡せばいいのかわからなくなってしまいます。

source: Be sure to call your `verify` methods on `PanacheMock` rather than `Mockito`, otherwise you won't know what mock object to pass.
ja_jp: `verify` のメソッドを `Mockito` ではなく `PanacheMock` で呼び出すようにしてください。そうしないと、どのモックオブジェクトを渡せばいいのかわかりません。

source: Be sure to read the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide for more information.
ja_jp: 詳細は、CDI ガイドの xref:cdi-reference.adoc#bean_discovery[Bean の検出] セクションを必ずお読みください。

source: Bean Class Registered by `AdditionalBeanBuildItem`
ja_jp: 登録されている Bean クラス `AdditionalBeanBuildItem`

source: Bean Defining Annotations
ja_jp: アノテーションを定義する Bean

source: Bean Discovery
ja_jp: Bean の検出

source: Bean Injecting a Bean Produced by an `AdditionalBeanBuildItem`
ja_jp: `AdditionalBeanBuildItem` によって構築された Bean をインジェクトするBean

source: Bean Validation and Reactive Routes
ja_jp: Bean Validation と Reactive Routes

source: Bean Validation constraints are now taken into account for parameters and return values (`Uni` is supported but not `Multi`) of Reactive Routes methods.
ja_jp: Bean Validation 制約が Reactive Routes メソッドのパラメーターと戻り値 ( `Uni` はサポートされていますが、 `Multi` はサポートされていません) で考慮されるようになりました。

source: Bean Validation is supported by Reactive Routes
ja_jp: Reactive Routes での Bean Validation サポート

source: Bean With Custom Qualifier Example
ja_jp: カスタム修飾子を持つ Bean の例

source: Bean classes added via `AdditionalBeanBuildItem` are _removable_ by default. If the container considers them <<cdi-reference.adoc#remove_unused_beans,unused>>, they are just ignored. However, you can use `AdditionalBeanBuildItem.Builder.setUnremovable()` method to instruct the container to never remove bean classes registered via this build item. See also <<cdi-reference.adoc#remove_unused_beans,Removing Unused Beans>> and <<unremovable_builditem>> for more details.
ja_jp: `AdditionalBeanBuildItem` 経由で追加された Bean クラスは、デフォルトでは _取り外し可能です_ 。コンテナーがそれらを link:cdi-reference.html#remove_unused_beans[未使用] とみなした場合、それらはただ無視されます。しかし、 `AdditionalBeanBuildItem.Builder.setUnremovable()` メソッドを使用して、このビルド項目を介して登録されたBeanクラスを絶対に削除しないようにコンテナーに指示することができます。詳細は、 link:cdi-reference.html#remove_unused_beans[未使用のBeanの削除] と link:#unremovable_builditem[理由3: クラスが検出され、Bean 定義のアノテーションがあるが削除された] も参照してください。

source: Bean classes added via `AdditionalBeanBuildItem` are _removable_ by default. If the container considers them xref:cdi-reference.adoc#remove_unused_beans[unused], they are just ignored. However, you can use `AdditionalBeanBuildItem.Builder.setUnremovable()` method to instruct the container to never remove bean classes registered via this build item. See also xref:cdi-reference.adoc#remove_unused_beans[Removing Unused Beans] and xref:unremovable_builditem[_Reason 3_: Class Was Discovered and Has a Bean Defining Annotation but Was Removed] for more details.
ja_jp: `AdditionalBeanBuildItem` を介して追加された Bean クラスは、デフォルトで _削除可能_ です。コンテナがそれらを xref:cdi-reference.adoc#remove_unused_beans[未使用] とみなした場合、それらはただ無視されます。しかし， `AdditionalBeanBuildItem.Builder.setUnremovable()` メソッドを使用すると，このビルド項目を通じて登録された Bean クラスを決して削除しないようにコンテナに指示することができます。詳細は， xref:cdi-reference.adoc#remove_unused_beans[未使用のBeanの削除] 及び xref:unremovable_builditem[理由3：クラスが発見され，Bean定義アノテーションを有するが削除された] も参照下さい。

source: Bean classes added via `BeanDefiningAnnotationBuildItem` are _not removable_ by default, i.e. the resulting beans must not be removed even if they are considered unused. However, you can change the default behavior. See also <<cdi-reference.adoc#remove_unused_beans,Removing Unused Beans>> and <<unremovable_builditem>> for more details.
ja_jp: `BeanDefiningAnnotationBuildItem` を介して追加された Bean クラスは、デフォルトでは _削除不可_ です。したがって、結果の Bean は未使用と見なされても削除しないでください。ただし、デフォルトの動作は変更できます。詳細については<<cdi-reference.adoc#remove_unused_beans,Removing Unused Beans>> および<<unremovable_builditem>> を参照してください。

source: Bean classes added via `BeanDefiningAnnotationBuildItem` are _not removable_ by default, i.e. the resulting beans must not be removed even if they are considered unused. However, you can change the default behaviour. See also <<cdi-reference.adoc#remove_unused_beans,Removing Unused Beans>> and <<unremovable_builditem>> for more details.
ja_jp: `BeanDefiningAnnotationBuildItem` を介して追加された Bean クラスは、デフォルトでは _削除不可_ です。つまり、結果の Bean は未使用とみなされても削除しないでください。ただし、デフォルトの動作は変更できます。詳細は、<<cdi-reference.adoc#remove_unused_beans,未使用の Bean の削除>> および <<unremovable_builditem>> も参照してください。

source: Bean classes that don't have a https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[bean defining annotation, window="_blank"] are not discovered. This behavior is defined by CDI. But producer methods and fields and observer methods are discovered even if the declaring class is not annotated with a bean defining annotation (this behavior is different to what is defined in CDI). In fact, the declaring bean classes are considered annotated with `@Dependent`.
ja_jp: https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#bean_defining_annotations[bean定義アノテーション, window="_blank"] を持たない Bean クラスは検出されません。この動作は CDI で定義されています。しかし、producer メソッドやフィールド、observer メソッドは、宣言クラスが Bean 定義アノテーションを持たない場合でも検出されます (この動作は CDI で定義されているものとは異なります)。実際には、Bean クラスの宣言は `@Dependent` でアノテーションされていると見なされます。

source: Bean classes that don't have a https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[bean defining annotation, window="_blank"] are not discovered. This behavior is defined by CDI. But producer methods and fields and observer methods are discovered even if the declaring class is not annotated with a bean defining annotation (this behavior is different to what is defined in CDI). In fact, the declaring bean classes are considered annotated with `@Dependent`.
ja_jp: https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bean_defining_annotations[bean 定義アノテーション, window="_blank"] のない Bean クラスは検出されません。 この動作は CDI によって定義されます。 ただし、宣言クラスに Bean 定義アノテーションが付けられていない場合でも、プロデューサーメソッドとフィールドおよびオブザーバーメソッドは検出されます (この動作は CDI で定義されているものと異なります)。 実際、宣言する Bean クラスは `@Dependent` でアノテーションが付けられていると見なされます。

source: Bean discovery
ja_jp: Beanディスカバリ

source: Bean discovery in CDI is a complex process which involves legacy deployment structures and accessibility requirements of the underlying module architecture. However, Quarkus is using a *simplified bean discovery*. There is only single bean archive with the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#default_bean_discovery[bean discovery mode `annotated`, window="_blank"] and no visibility boundaries.
ja_jp: CDI での Bean 検出は、レガシーなデプロイメント構造と、基礎となるモジュールアーキテクチャーのアクセシビリティ要件を含む複雑なプロセスです。しかし、Quarkusは *簡素化された Bean 検出* を使用しています。 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#default_bean_discovery[`annotated` bean検出モード, window="_blank"] と可視性の境界がない単一の Bean アーカイブのみが存在します。

source: Bean discovery in CDI is a complex process which involves legacy deployment structures and accessibility requirements of the underlying module architecture. However, Quarkus is using a *simplified bean discovery*. There is only single bean archive with the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#default_bean_discovery[bean discovery mode `annotated`, window="_blank"] and no visibility boundaries.
ja_jp: CDI での Bean 検出は、従来のデプロイメント構造と、基盤となるモジュールアーキテクチャーのアクセシビリティー要件が関係する複雑なプロセスです。 ただし、Quarkus は *簡略化された Bean 検出* を使用しています。 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#default_bean_discovery[bean 検出モード `annotated`, window="_blank"] および可視性境界のない単一の Bean アーカイブのみが存在します。

source: Bean initialization
ja_jp: Bean 初期化

source: Bean style classes can also be use as the input parameter type. Here's an example:
ja_jp: Bean スタイルクラスを入力パラメーター型として使用することもできます。以下に例を示します。

source: Beans accessed and used during startup are not subject to automatic mocking, even if the test declares injection points with the same bean types annotated with @InjectMock or @InjectSpy. Mocking is a local operation within a test, whereas startup is a global operation for executing many tests. In such cases, the recommendation is to use the <<mock-cdi-alternative>>.
ja_jp: 起動時にアクセスおよび使用される Bean は、テストが @InjectMock または @InjectSpy でアノテーションが付けられた同じ Bean タイプを持つインジェクションポイントを宣言しても、自動モックの対象にはなりません。モックはテスト内のローカルな操作ですが、起動は多数のテストを実行するためのグローバルな操作です。このような場合、<<mock-cdi-alternative>> を使用することをお勧めします。

source: Beans annotated with `@CommandLine.Command` should not use proxied scopes (e.g. do not use `@ApplicationScoped`) because Picocli will not be able to set field values in such beans. By default, this Picocli extension registers classes annotated with `@CommandLine.Command` with the `@Dependent` scope. If you need to use a proxied scope, then annotate the setters and not the fields, for example:
ja_jp: `@CommandLine.Command` でアノテーションが付けられた Bean では、プロキシーされるスコープ (例: `@ApplicationScoped`) を使用しないでください 。 Picocli はそのような Bean にフィールド値を設定できないためです。 デフォルトでは、この Picocli エクステンションは `@CommandLine.Command` でアノテーションが付けられたクラスを `@Dependent` スコープを使用して登録します。プロキシーされるスコープを使用する必要がある場合は、次の例のように、フィールドではなくセッターにアノテーションを付けてください。

source: Beans backed by classes
ja_jp: クラスに裏付けられたBean

source: Beans may also produce and consume events to interact in a completely decoupled fashion. Any Java object can serve as an event payload. The optional qualifiers act as topic selectors.
ja_jp: Beanは、完全に分離された方法で相互作用するために、イベントを生成したり消費したりすることもできます。任意の Java オブジェクトをイベントのペイロードとして使用できます。オプションの修飾子は、トピックセレクタとして機能します。

source: Beans with `@CommandLine.Command` should not use proxied scopes (e.g. do not use `@ApplicationScope`) because Picocli will not be able set field values in such beans. This extension will register classes with `@CommandLine.Command` annotation using `@Depended` scope. If you need to use proxied scope, then annotate setter and not field, for example:
ja_jp: `@CommandLine.Command` を持つ Bean では、プロキシーされるスコープを使用してはいけません (例: `@ApplicationScope` は使用しないでください)。Picocli はそのような Bean でフィールド値を設定できないためです。このエクステンションは `@CommandLine.Command` アノテーションを持つクラスを `@Depended` スコープを使って登録します。プロキシーされるスコープを使用する必要がある場合は、フィールドではなくセッターを次の例のようにアノテーションしてください。

source: Beans with `@CommandLine.Command` should not use proxied scopes (e.g. do not use `@ApplicationScope`) because Picocli will not be able to set field values in such beans. This extension will register classes with `@CommandLine.Command` annotation using `@Depended` scope. If you need to use proxied scope, then annotate setter and not field, for example:
ja_jp: `@CommandLine.Command` を持つ Bean では、プロキシーされるスコープを使用してはいけません (例: `@ApplicationScope` は使用しないでください)。Picocli はそのような Bean でフィールド値を設定できないためです。このエクステンションは `@CommandLine.Command` アノテーションを持つクラスを `@Depended` スコープを使って登録します。プロキシーされるスコープを使用する必要がある場合は、フィールドではなくセッターを次の例のようにアノテーションしてください。

source: Bearer JWT verification
ja_jp: ベアラー JWT の検証

source: Bearer JWT verification is required
ja_jp: ベアラー JWTの検証が必要です。

source: Bearer Opaque Token verification is required
ja_jp: ベアラー不透明 Tokenの検証が必要です。

source: Bearer Token Authorization is the process of authorizing HTTP requests based on the existence and validity of a Bearer Token which provides valuable information to determine the subject of the call as well as whether or not an HTTP resource can be accessed.
ja_jp: ベアラートークン認可とは、ベアラートークンの存在と有効性に基づいて HTTP リクエストを認証するプロセスで、HTTP リソースにアクセスできるかどうかだけでなく、呼び出しの対象を決定するための価値のある情報を提供します。

source: Bearer Token Authorization is the process of authorizing HTTP requests based on the existence and validity of a Bearer Token. The Bearer Token provides information about the subject of the call which is used to determine whether or not an HTTP resource can be accessed.
ja_jp: Bearer Token認可とは、Bearer Tokenの存在と有効性に基づいて HTTP リクエストを認可するプロセスで、HTTP リソースにアクセスできるかどうかだけでなく、呼び出しの対象を決定するための価値のある情報を提供します。

source: Bearer Token Authorization mechanism in Quarkus with Java or command line client
ja_jp: Javaまたはコマンドラインクライアントを使用したQuarkusのBearer Token認可メカニズム

source: Bearer Token Authorization mechanism in Quarkus with Single-page application
ja_jp: QuarkusにおけるBearer Tokenによる認可メカニズムとシングルページアプリケーション

source: Bearer Token authentication mechanism
ja_jp: ベアラートークン認証メカニズム

source: Bearer access token
ja_jp: ベアラーアクセストークン

source: Bearer access token must have an `acr` claim with the `myACR` ACR value and be in use for no longer than 120 minutes since the authentication time.
ja_jp: ベアラーアクセストークンは、 `myACR` ACR 値を持つ `acr` クレームを持ち、認証時刻から 120 分を超えて使用されていない必要があります。

source: Bearer access token must have an `acr` claim with the `myACR` ACR value.
ja_jp: ベアラーアクセストークンは、 `myACR` ACR 値を持つ `acr` クレームを持っている必要があります。

source: Bearer opaque token verification
ja_jp: ベアラー不透明トークンの検証

source: Bearer token authentication
ja_jp: ベアラートークン認証

source: Bearer token authentication is the process of authorizing HTTP requests based on the existence and validity of a bearer token. The bearer token provides information about the subject of the call, which is used to determine whether or not an HTTP resource can be accessed.
ja_jp: ベアラートークン認証は、ベアラートークンの存在と有効性に基づいて HTTP リクエストを認可するプロセスです。 ベアラートークンは、呼び出しの主体に関する情報を提供します。この情報は、HTTP リソースにアクセスできるかどうかを判断するために使用されます。

source: Bearer token authentication mechanism
ja_jp: ベアラートークン認証メカニズム

source: Bearer token authentication mechanism in Quarkus with Java or command line client
ja_jp: Quarkus のベアラートークン認証メカニズムとJava またはコマンドラインクライアント

source: Bearer token authentication mechanism in Quarkus with Single-page application
ja_jp: Quarkusのシングルページアプリケーションにおけるベアラー認証メカニズム

source: Bearer token authentication mechanism in Quarkus with single-page application
ja_jp: Quarkus のベアラー認証メカニズムとシングルページアプリケーション

source: Bearer token authentication mechanism is used, because a Bearer access token is sent with the HTTP request.
ja_jp: ベアラーアクセストークンが HTTP リクエストとともに送信されるため、ベアラートークン認証メカニズムが使用されます。

source: Bearer token header
ja_jp: ベアラートークンヘッダー

source: Bearer token header properties
ja_jp: ベアラートークンヘッダープロパティー

source: Because Funqy is an abstraction that spans multiple different cloud/function providers and protocols it has to be a very simple API and thus, might not have all the features you are used to in other remoting abstractions. A nice side effect though is that Funqy is as optimized and as small as possible. This means that because Funqy sacrifices a little bit on flexibility, you'll get a framework that has little to no overhead.
ja_jp: Funqy は複数の異なるクラウド/ファンクションプロバイダやプロトコルにまたがる抽象化なので、非常にシンプルな API でなければならず、あなたが使い慣れている他のリモーティング抽象化で提供される機能をすべて備えているわけではないかもしれません。しかし、良い副作用として、Funqyは可能な限り最適化されていて小さいということがあります。つまり、Funqy は柔軟性を少し犠牲にしているので、オーバーヘッドがほとんどないフレームワークを手に入れることができます。

source: Because Funqy is an abstraction that spans multiple different cloud/function providers and protocols it has to be a very simple API and thus, might not have all the features you are used to in other remoting abstractions. A nice side effect though is that Funqy is as optimized and as small as possible. This means that because Funqy sacrifices a little on flexibility, you'll get a framework that has little to no overhead.
ja_jp: Funqy は複数の異なるクラウド、ファンクションプロバイダーやプロトコルに跨った抽象化を提供するため、その API は非常にシンプルである必要があり、ユーザーが使い慣れている他のリモーティング抽象化で提供される機能を全て備えているとは限りません。一方で、Funqy は可能な限り最適化され、かつ小さいという良い副次的効果があります。これは、Funqy は柔軟性を少し犠牲にしている分、オーバーヘッドが非常に少ないフレームワークであることを意味しています。

source: Because JKS is no longer the default keystore and truststore format in Quarkus, the framework makes an educated guess based on the file extension:
ja_jp: JKS は Quarkus のデフォルトのキーストアおよびトラストストア形式ではなくなったため、Quarkus のフレームワークはファイル拡張子に基づいて推測を行います。

source: Because Quarkus Security is customizable, for example, you can add authorization roles to `SecurityIdentity`, you can register and prioritize one or more custom security augmentors.
ja_jp: Quarkus Securityはカスタマイズ可能であるため、例えば、認可ロールを `SecurityIdentity` に追加できるため、1 つ以上のカスタム セキュリティ augmentorを登録して優先順位を付けることができます。

source: Because Quarkus Security is customizable, you can, for example, add authorization roles to `SecurityIdentity` and register and prioritize one or more `SecurityAugmentor` implementations.
ja_jp: Quarkus Securityはカスタマイズ可能であるため、たとえば、認可ロールを `SecurityIdentity` に追加したり、1つまたは複数の `SecurityAugmentor` 実装を登録し、優先順位を付けることができます。

source: Because SmallRye Reactive Messaging framework supports different messaging backends like Apache Kafka, AMQP, Apache Camel, JMS, MQTT, etc., it employs a generic vocabulary:
ja_jp: Smallrye Reactive Messaging フレームワークは、Apache Kafka、AMQP、Apache Camel、JMS、MQTT など、さまざまなメッセージングバックエンドをサポートしているため、汎用的な語彙を使用しています。

source: Because SmallRye Reactive Messaging framework supports different messaging backends like Apache Kafka, Apache Pulsar, AMQP, Apache Camel, JMS, MQTT, etc., it employs a generic vocabulary:
ja_jp: SmallRye Reactive Messaging フレームワークは、Apache Kafka、Apache Pulsar、AMQP、Apache Camel、JMS、MQTT などのさまざまなメッセージングバックエンドをサポートしているため、汎用的な語彙を使用しています。

source: Because Smallrye Reactive Messaging framework supports different messaging backends like Apache Kafka, AMQP, Apache Camel, JMS, MQTT, etc., it employs a generic vocabulary:
ja_jp: Smallrye Reactive Messaging フレームワークは、Apache Kafka、AMQP、Apache Camel、JMS、MQTT など、さまざまなメッセージングバックエンドをサポートしているため、汎用的な語彙を使用しています。

source: Because `GreetingResource` is annotated with `@Path("/hello")` the injected URL will end with `/hello`.
ja_jp: `GreetingResource` は `@Path("/hello")` とアノテーションされているので、注入された URL は `/hello` で終わります。

source: Because interfaces can't define fields, we have to implement the getters
ja_jp: インターフェースはフィールドを定義できないので、ゲッターを実装する必要があります。

source: Because it is very inconvenient to send emails during development and testing, you can set the `quarkus.mailer.mock` boolean configuration to `true` to prevent the actual sending of emails but instead print them on stdout and collect them in a `MockMailbox` bean instead. This is the default if you are running Quarkus in `DEV` or `TEST` mode.
ja_jp: 開発やテスト中に電子メールを送信するのは非常に不便なため、 `quarkus.mailer.mock` ブーリアン構成を `true` に設定することで、実際に電子メールを送信せず、代わりに標準出力に印刷し、代わりに `MockMailbox` ビーンに収集することができます。これは、Quarkusを `DEV` または `TEST` モードで実行している場合のデフォルトです。

source: Because it is very inconvenient to send emails during development and testing, you can set the `quarkus.mailer.mock` boolean configuration to `true` to prevent the actual sending of emails but instead print them on stdout and collect them in a `MockMailbox` bean instead. This is the default if you are running Quarkus in dev or test mode.
ja_jp: 開発中やテスト中にメールを送信するのは非常に不便であるため、 `quarkus.mailer.mock` boolean設定を `true` に設定することで、 実際のメール送信は行われず、代わりに標準出力にメールが出力され、 `MockMailbox` Beanにメールが収集されます。 これは、Quarkusを開発モードまたはテストモードで実行している場合のデフォルトです。

source: Because it's the _canonical_ web socket application, we are going to create a simple chat application.
ja_jp: これは _canonical_ な Web ソケットアプリケーションなので、シンプルなチャットアプリケーションを作成します。

source: Because ngrok only forwards ACME challenges over HTTP, start ngrok by using the following command:
ja_jp: ngrok は ACME チャレンジを HTTP 経由でのみ転送するため、次のコマンドを使用して ngrok を起動します。

source: Because ngrok only forwards ACME challenges over HTTP, start ngrok with the following command:
ja_jp: ngrok は ACME チャレンジを HTTP 経由でのみ転送するため、次のコマンドで ngrok を起動します。

source: Because no `Timeslot` instances change during solving, a `Timeslot` is called a _problem fact_. Such classes do not require any OptaPlanner specific annotations.
ja_jp: 解決する間は `Timeslot` インスタンスは変更されないため、 `Timeslot` は_問題の事実_と呼ばれます。このようなクラスに、OptaPlanner 固有のアノテーションは必要ありません。

source: Because of how SnapStart works with snapshots and resumes the execution environment with low latency, this benefits functions written with Quarkus. Quarkus can leverage the snapshotting and warm-up code paths for the libraries Quarkus supports.
ja_jp: SnapStartはスナップショットで動作し、低レイテンシーで実行環境を再開するため、Quarkusで記述された関数にメリットがあります。Quarkusは、Quarkusがサポートするライブラリのスナップショットおよびウォームアップのコードパスを活用できます。

source: Because of the additional class, our property names have changed. Let's update the properties file and the `GreetingResource` class.
ja_jp: クラスが追加されたため、プロパティ名が変更されています。プロパティファイルと `GreetingResource` クラスを更新してみましょう。

source: Because of the packaging of `protoc` and the plugin (using classifier), it's not possible to exclude undesired platforms individually.
ja_jp: `protoc` とプラグインのパッケージング (分類子を使用) により、不要なプラットフォームを個別に除外することはできません。

source: Because of this change, consider the following:
ja_jp: この変更に伴い、以下のことを検討してください：

source: Because of this, in the case of Maven, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit 5:
ja_jp: Maven の場合、デフォルトでは JUnit 5 に対応していないため、 https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] のバージョンを設定する必要があります。

source: Because of this, in the case of Maven, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit:
ja_jp: このため、Maven の場合、デフォルトのバージョンは JUnit をサポートしていないため、 https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] のバージョンを設定する必要があります。

source: Because ping messages are handled automatically and pong messages require no response, it is not necessary to write handlers for these messages to comply with the WebSocket protocol. However, it is sometimes useful to know when ping or pong messages are received by an endpoint.
ja_jp: ping メッセージは自動的に処理され、pong メッセージはレスポンスを必要としないため、WebSocket プロトコルに準拠するためにこれらのメッセージのハンドラーを記述する必要はありません。 ただし、エンドポイントで ping または pong メッセージがいつ受信されたかを知ることが役立つ場合があります。

source: Because query operations do not belong on instances of our entities, we will place these operations on another type called a `Repository`, and because those queries are intimately tied with the entities they operate on, we recommend placing them on an interface nested in the entity:
ja_jp: クエリ操作はエンティティのインスタンスに属さないため、これらの操作は `Repository` と呼ばれる別の型に配置します。また、それらのクエリは操作対象のエンティティと密接に結びついているため、エンティティ内にネストされたインターフェースに配置することをお勧めします。
